{
    "resume_repo": "https://github.com/m3rlin45/resume",
    "basics": {
        "name": "Christopher Dewan",
        "label": "Software and Hardware Engineer",
        "picture": "",
        "email": "Chris.Dewan@m3rlin.net",
        "website": "http://m3rlin.net",
        "summary": "Physicist turned Electrical Engineer turned Software Engineer with a hint of management. I'm looking to work with strong teams on challenging, multi-disciplinary problems with a system level outlook.",
        "location": {
            "city": "Los Angeles",
            "countryCode": "USA",
            "region": "California"
        }
    },
    "work": [
	{
	    "company": "Facebook",
	    "title": "Principal Software Engineer",
	    "website": "https://www.facebook.com",
	    "location": "Menlo Park, CA, USA",
	    "roles": [
                {
		    "position": "Engineering Technical Lead for Facebook AI Content Understanding Services",
		    "startDate": "2020-02-01",
		    "summary": "As overall technical leader for content understanding. I am the responsible authority for the strategy, technical architecture, and execution of our team spanning multiple key computer vision and natural language processing (NLP) serving the needs of all of Facebook.",
		    "highlights": [
                        "Wrote the business case for a centralized state of the art (SOTA) text understanding service at Facebook. Built the engineering/research partnership to build it. Designed the system architecture and implemented several of the most complex components. This is the flagship project of our team and the premier text understanding system at Facebook. We delivered it into production despite a company wide capacity crunch and delivered significant business impact working as #oneteam across organizational boundaries.",
                        "Partnered across organizations to build the case for a centralized SOTA multi-modal content understanding system. Led the combined research and engineering work that brought it to production as #oneteam.",
                        "Drove the technical and business strategy for a new team that centralized content understanding AI services used to understand both language and images across Facebook and Instagram.",
                        "Drove workload definitions and initial business case for large scale research training clusters at Facebook",
                        "When COVID-19 Caused a simultaneous jump in internet usage and global supply chain challenges I drove Facebook AI's efficiency efforts far beyond the target baseline and we delivered big wins.",
                        "Mentor to 14 simultaneous mentees, including IC's and managers across multiple teams. I helped them achieve career goals including promotions, project successes, and team changes."
		    ]
		},
		{
		    "position": "Tech Lead Manager for Facebook AI NLP Infrastructure",
		    "startDate": "2018-07-01",
                    "endDate": "2020-02-01",
		    "summary": "Combined role of both people management and technical leadership of the NLP Infrastructure team.",
		    "highlights": [
			"Expanded the team's scope beyond inference, building a collaboration with with the FB Assistant Language team to build the open source PyText training platform to bring PyTorch based NLP models to all of Facebook.",
			"Led the push to bring new hardware capabilities into FB in a very short timeframe. This unblocked the research that resulted in the RoBERTa and XLM-R models.",
			"Hired and grew my team from 4 to 8, and supported the growth of individuals on the team.",
			"Drove a broad effort across Facebook AI to improve engineering standards.",
                        "Built the business case for a crash effort to bring GPUs to production for inference for the first time at Facebook and provided management cover for this controversial project whose success changed FB AI Hardware Strategy.",
			"Recognized that by doing two jobs I was a bottleneck for the team growth, as I couldn't support enough people to match our needs. I chose to split my role into two and reverted back to Technical Lead."
		    ]
		},
		{
		    "position": "Facebook AI NLP Infrastructure Technical Lead",
		    "startDate": "2017-09-01",
		    "endDate": "2018-06-30",
		    "summary": "As engineering lead for NLP Infrastructure, getting research into production was my job.",
		    "highlights": [
			"Built a generic auto-scaling microservice system for serving many ML models efficiently. This was extended beyond NLP and took over most non-ads ML inference workloads at Facebook.",
			"Greatly expanded the scale and efficiency of Translation inference at Facebook.",
			"Supported my manager and helped hire and grow new talent within the team."
		    ]
		},
		{
		    "position": "Translation Infrastructure Engineer",
		    "startDate": "2016-01-01",
		    "endDate": "2017-09-01",
		    "summary": "As the first infra engineer on Facebook Translation, I made our system more scalable and reliable",
		    "highlights": [
			"Drove the inference infrastructure migration from statistical to neural machine translation at FB.",
			"Rearchitected translation inference to significantly increase reliability.",
			"Built the hot-fix system used to respond to bad translations at Facebook for Neural Machine Translation"
		    ]
		}
	    ]
	},
        {
            "company": "Raytheon",
            "title": "Senior Multi-Disciplined Engineer",
            "website": "http://raytheon.com",
            "location":  "El Segundo, CA, USA",
            "roles": [
                {
                    "position": "Adviser to Software Center Management",
                    "startDate": "2015-01-01",
                    "endDate": "2015-09-09",
                    "summary": "Led effort to improve hiring and retention for software engineers. I recieved an award for this work.",
                    "highlights": [
                        "Created a tailored new interview loop focused on relevant skills with expanded use of technical questions.",
                        "Organized an effort to ensure new hires would have real work, improving morale and retention."
                    ]
                },
                {
                    "position": "VIIRS Ground Support Equipment Responsible Engineering Authority",
                    "startDate": "2012-08-01",
                    "endDate": "2015-09-09",
                    "summary": "I was the engineering owner of the ground station and spacecraft simulators used to test VIIRS (Visible Infrared Imaging Radiometer Suite), a calibrated spaceborne weather sensor. My upgrades reduced errors during the test program by 80%. I received 3 personal and 7 team Mission Success Awards for this work.",
                    "highlights": [
                        "Made the case for, designed, and executed a rewrite of the simulator software. (~40,000 lines of C++)",
                        "Designed and built an adapter board so inexpensive commercial hardware could be used in test.",
                        "Redesigned the simulator for SpaceWire connectivity to support VIIRS upgrades.",
                        "Built and maintained a data aggregation system which cut analysis time from hours to minutes.",
                        "Provided 24/7 on call support for months of continuous testing."
                    ]
                },
                {
                    "position": "Raytheon Capital Test Station: Electrical and Software Architect",
                    "startDate": "2011-04-01",
                    "endDate": "2012-08-01",
                    "summary": "Software/hardware design of a test station offering new capabilities to customer programs and internal R&D. I received a Raytheon Innovation Award for the novice configuration database I designed.",
                    "highlights": [
                        "Gathered electrical and software requirements and designed an overall architecture, selected the hardware, and did detailed hardware design, both electrical and mechanical",
                        "Designed and built the software stack, including a web app and API for configuration data and telemetry, along with a client library integrated into LabVIEW, our test software platform. (~10,000 lines of C# and HTML)"
                    ]
                },
                {
                    "position": "Test Systems Engineer",
                    "startDate": "2010-06-21",
                    "endDate": "2011-04-01",
                    "summary": "Designed Test apparatus and components, supported test programs and R&D efforts."
                }
            ]
        },
        {
            "company": "NTT Communication Science Laboratories",
            "title": "Summer Intern",
            "website": "http://www.kecl.ntt.co.jp/rps/english/index_e.html",
            "location":  "Atsugi-shi, Kanagawa, Japan",
            "roles": [
                {
                    "startDate": "2009-06-22",
                    "endDate": "2009-08-28",
                    "summary": "Worked in the vision group of the NTT Behavioral Research Lab in the NTT Atsugi R&D Center. Studied how reflections affect human visual inference of materials and illuminants.",
                    "highlights": [
                        "Experimented with machine vision techniques for manipulating specular and matter reflection in an image.",
                        "Designed and built an apparatus to separate matte and specular reflection in a scene using polarization."
                    ]
                }
            ]
        },
        {
            "company": "Caltech Physics Department",
            "title": "Laboratory Teaching Assistant",
            "website": "http://www.caltech.edu",
            "location": "Pasadena, CA, USA",
            "roles": [
                {
                    "startDate": "2008-10-01",
                    "endDate": "2009-12-01"
                }
            ]
        }
    ],
    "education": [
        {
            "institution": "Caltech",
            "area": "Physics",
            "studyType": "BS",
            "startDate": "2006-10-01",
            "endDate": "2010-06-01",
            "gpa": "3.5"
        }
    ],
    "skills": [
        {
            "name": "Programming",
            "level": "Major Work",
            "keywords": [
                "C++",
                "Python",
                "PyTorch"
            ]
        },
        {
            "name": "Programming",
            "level": "Minor Work",
            "keywords": [
                "C#",
                "Javascript",
                "HTML",
                "CSS"
            ]
        },
        {
            "name": "Engineering",
            "level": "Major Work",
            "keywords": [
                "Distributed Systems",
                "Unit Testing",
                "Continuous Integration",
                "Analytics",
                "AI Hardware Strategy"
            ]
        },
        {
            "name": "Leadership",
            "level": "Major Work",
            "keywords": [
                "People Management",
                "Mentorship",
                "Cross Functional Alignment",
                "Performance Review"
            ]
        }
        
    ],
            "languages": [
                {
                    "language": "English",
                    "fluency": "Native speaker"
                },
                {
                    "language": "Japanese",
                    "fluency": "JLPT N1"
                }
            ],
            "interests": [
                {
                    "name": "Photography",
                    "keywords": [
                        "Landscape",
                        "Product",
                        "Motorsports"
                    ]
                },
                {
                    "name": "Reading",
                    "keywords": [
                        "History",
                        "Economics",
                        "Biography"
                    ]
                },
                {
                    "name": "Technology",
                    "keywords": [
                        "Computer Hardware",
                        "Video Gaming",
                        "Virtual Reality"
                    ]
                }
            ]
        }
