{
    "basics": {
        "name": "Christopher Dewan",
        "label": "Software and Hardware Engineer",
        "picture": "",
        "email": "Chris.Dewan@m3rlin.net",
        "website": "http://m3rlin.net",
        "summary": "Physicist turned Electrical Engineer turned Software Engineer with a hint of management. I'm looking to work with strong teams on challenging, multi-disciplinary problems with a system level outlook.",
        "location": {
            "city": "Los Angeles",
            "countryCode": "USA",
            "region": "California"
        },
        "profiles": [
            {
                "network": "Github",
                "url": "https://github.com/m3rlin45",
                "username": "m3rlin45"
            },
            {
                "network": "Picasa",
                "url": "https://picasaweb.google.com/m3rlin45",
                "username": "m3rlin45"
            },
            {
                "network": "Resume Source",
                "username": "This resume is code",
                "url": "https://github.com/m3rlin45/resume"
            }
        ]
    },
    "work": [
	{
	    "company": "Facebook",
	    "title": "Principal Software Engineer",
	    "website": "https://www.facebook.com",
	    "location": "Menlo Park, CA, USA",
	    "roles": [
		{
		    "position": "Tech Lead Manager for NLP Infrastructure",
		    "startDate": "2018-07-01",
		    "summary": "A blended role of management and engineering leadership. I led the NLP Infrastructure team in Facebook AI.",
		    "highlights": [
			"Expanded the team beyond just inference into NLP training platforms forming a collaboration with the FB Assistant Language team to build the open source PyText platform to bring PyTorch based NLP models to all of Facebook.",
			"Led the push to bring new hardware capabilities into FB in very short timeframes which paved the way for Facebook's RoBERTa and XLM-R models to be invented and productized in the same year.",
			"Grew the team from 4 to 8 to support our needs, and supported the growth of individuals on the team.",
			"Drove a broad effort across Facebook AI to improve engineering standards and maintenance",
			"Recognized that the blended role was insufficient for the team size needed to realize our ambitions and hired an experienced manager to take over the people management side so I could focus on technical direction. This transition is ongoing."
		    ]
		},
		{
		    "position": "NLP Infrastructure Technical Lead",
		    "startDate": "2017-09-01",
		    "endDate": "2018-06-30",
		    "summary": "As the engineering leader of the NLP Infrastructure team in Facebook AI, I was responsible for making sure that our research got to production and worked.",
		    "highlights": [
			"Built a generic auto-scaling microservice system for serving many ML models efficiently. This was extended beyond NLP and took over most non-ads ML inference workloads at Facebook.",
			"Greatly expanded the scale and efficiency of Translation inference at Facebook",
			"Supported my manager and helped hire and grow new talent within the team"
		    ]
		},
		{
		    "position": "Translation Infrastructure Engineer",
		    "startDate": "2016-01-01",
		    "endDate": "2017-09-01",
		    "summary": "As the first infra engineer in the Facebook Translation Team, I worked to make our inference scalable and reliable",
		    "highlights": [
			"Drove the inference infrastructure side of migrating translation at FB to neural networks, which required vastly more compute than statistical methods.",
			"Significantly increased the reliability of translations at Facebook through better system architecture.",
			"Built the hot-fix system used to respond to bad translations at Facebook for Neural Machine Translation"
		    ]
		}
	    ]
	},
        {
            "company": "Raytheon",
            "title": "Senior Multi-Disciplined Engineer",
            "website": "http://raytheon.com",
            "location":  "El Segundo, CA, USA",
            "roles": [
                {
                    "position": "Adviser to Software Center Management",
                    "startDate": "2015-01-01",
                    "endDate": "2015-09-09",
                    "summary": "Led an effort in Software Engineering Center to improve talent acquisition and retention.",
                    "highlights": [
                        "Added an emphasis on system and hardware skills for test and measurement software roles.",
                        "Expanded the duration of on-site interviews and their technical scope.",
                        "Organized an effort to ensure new hires would have real work, improving morale and retention.",
                        "Performed resume screening, phone screening, and on-site interviews."
                    ]
                },
                {
                    "position": "VIIRS Ground Support Equipment Responsible Engineering Authority",
                    "startDate": "2012-08-01",
                    "endDate": "2015-09-09",
                    "summary": "VIIRS (Visible Infrared Imaging Radiometer Suite) is a calibrated spaceborne sensor for weather prediction. My team tests it extensively prior to launch.",
                    "highlights": [
                        "Engineering owner of the ground station and spacecraft simulators for VIIRS test program.",
                        "Made the case for, designed, and executed a rewrite of the simulator software. (~40,000 lines of C++)",
                        "Designed and built an adapter board so inexpensive commercial communications hardware could be used.",
                        "Redesigned the simulator for SpaceWire connectivity to support VIIRS upgrades.",
                        "Built and maintained a data aggregation system which cut analysis time from hours to minutes.",
                        "Provided 24/7 on call support for months of continuous testing.",
                        "As a result of upgrades, test program had a marked (80%) reduction in errors caused by the simulators."
                    ]
                },
                {
                    "position": "Raytheon Capital Test Station: Electrical and Software Architect",
                    "startDate": "2011-04-01",
                    "endDate": "2012-08-01",
                    "summary": "Software/hardware design of a test station offering new capabilities to customer programs and internal R&D.",
                    "highlights": [
                        "Gathered electrical and software requirements and designed an overall architecture.",
                        "Designed and built the hardware, including interconnect, wiring, and mechanical design.",
                        "Built a web app and API for configuration data and telemetry. (~10,000 lines of C# and HTML)",
                        "Built a client library for the API that could be easily consumed in LabVIEW.",
                        "Worked closely with the LabVIEW team, resulting in smooth integration."
                    ]
                },
                {
                    "position": "Test Systems Engineer",
                    "startDate": "2010-06-21",
                    "endDate": "2011-04-01",
                    "summary": "Designed Test apparatus and components, supported test programs and R&D efforts.",
                    "highlights": [
                        "Designed circuit boards and enclosures to support testing of space hardware.",
                        "Supported a field test of a new method for vicarious calibration of satellites.",
                        "Performed radiometric calibration of a hyperspectral sensor."
                    ]
                }
            ]
        },
        {
            "company": "NTT Communication Science Laboratories",
            "title": "Summer Intern",
            "website": "http://www.kecl.ntt.co.jp/rps/english/index_e.html",
            "location":  "Atsugi-shi, Kanagawa, Japan",
            "roles": [
                {
                    "startDate": "2009-06-22",
                    "endDate": "2009-08-28",
                    "summary": "Worked in the vision group of the NTT Behavioral Research Lab in the NTT Atsugi R&D Center. Studied how reflections affect human visual inference of materials and illuminants.",
                    "highlights": [
                        "Experimented with machine vision techniques for manipulating specular and matter reflection in an image.",
                        "Designed and built an apparatus to separate matte and specular reflection in a scene using polarization."
                    ]
                }
            ]
        },
        {
            "company": "Caltech Physics Department",
            "title": "Teaching Assistant",
            "website": "http://www.caltech.edu",
            "location": "Pasadena, CA, USA",
            "roles": [
                {
                    "startDate": "2008-10-01",
                    "endDate": "2009-12-01",
                    "summary": "Instructed physics students in a hands on laboratory environment. Topics included: analog circuit design and analysis, mass spectroscopy, electron diffraction, and light spectroscopy."
                }
            ]
        }
    ],
    "education": [
        {
            "institution": "Caltech",
            "area": "Physics",
            "studyType": "BS",
            "startDate": "2006-10-01",
            "endDate": "2010-06-01",
            "gpa": "3.5"
        }
    ],
    "awards": [
        {
            "title": "Innovation Award",
            "date": "2012-11-01",
            "awarder": "Raytheon",
            "summary": "Award for a novel configuration database scheme for a test station"
        },
        {
            "title": "Mission Success Awards",
            "date": "2015-04-27",
            "awarder": "Raytheon VIIRS Program",
            "summary": "Received 3 personal contributions award and 7 team contribution awards on the VIIRS program."
        },
        {
            "title": "Award for Personal Contribution",
            "date": "2015-02-11",
            "awarder": "Raytheon Software Center",
            "summary": "Awarded for work in improving hiring process in the Software Center."
        }
    ],
    "skills": [
        {
            "name": "Languages",
            "level": "Major Work",
            "keywords": [
                "C#",
                "C++"
            ]
        },
        {
            "name": "Frameworks",
            "level": "Major Work",
            "keywords": [
                "C++11/14",
                "boost",
                "boost::test",
                "Intel TBB",
                "ASP.NET MVC"
            ]
        },
        {
            "name": "Languages",
            "level": "Minor Work",
            "keywords": [
                "Javascript",
                "HTML",
                "CSS",
                "Powershell",
                "LaTeX",
                "LabVIEW"
            ]
        },
        {
            "name": "Frameworks",
            "level": "Minor Work",
            "keywords": [
                "node.js",
                "nunjucks.js",
                "Log4CXX",
                "MSTest",
                "Entity Framework"
            ]
        },
        {
            "name": "Techniques",
            "level": "Major Work",
            "keywords": [
                "Unit Testing",
                "Continuous Integration",
                "White Box Reverse Engineering",
                "Scrum"
            ]
        },
        {
            "name": "Hardware Test",
            "level": "Major Work",
            "keywords": [
                "Test Design",
                "Apparatus Design",
                "Test Conduction",
                "Data Analysis"
            ]
        },
        {
            "name": "Electronics",
            "level": "Minor Work",
            "keywords": [
                "Parts Selection",
                "Circuit Design",
                "Schematic Capture",
                "Fabrication"
            ]
        }
    ],
            "languages": [
                {
                    "language": "English",
                    "fluency": "Native speaker"
                },
                {
                    "language": "Japanese",
                    "fluency": "JLPT N1"
                }
            ],
            "interests": [
                {
                    "name": "Photography",
                    "keywords": [
                        "Landscape",
                        "Product",
                        "Motorsports"
                    ]
                },
                {
                    "name": "Reading",
                    "keywords": [
                        "History",
                        "Economics",
                        "Biography"
                    ]
                },
                {
                    "name": "Technology",
                    "keywords": [
                        "Computer Hardware",
                        "Video Gaming",
                        "Virtual Reality"
                    ]
                }
            ]
        }
