{
    "basics": {
        "name": "Christopher Dewan",
        "label": "I work on spaceship parts!",
        "picture": "",
        "email": "Chris.Dewan@outlook.com",
        "website": "http://m3rlin.net",
        "summary": "I work on spaceship parts!",
        "location": {
            "city": "Los Angeles",
            "countryCode": "US",
            "region": "California"
        },
        "profiles": [
            {
                "network": "Github",
                "url": "https://github.com/m3rlin45",
                "username": "m3rlin45"
            },
            {
                "network": "Picasa",
                "url": "https://picasaweb.google.com/m3rlin45",
                "username": "m3rlin45"
            },
            {
                "network": "Resume JSON",
                "username": "This resume is built using CI from this repository",
                "url": "https://github.com/m3rlin45/resume"
            }
        ]
    },
    "work": [
        {
            "company": "Raytheon",
            "position": "Adviser to Software Center Management",
            "website": "http://raytheon.com",
            "startDate": "2015-01-01",
            "summary": "Led an effort in Software Engineering Center to improve talent acquisition and retention.",
            "highlights": [
                "Added an emphasis on hiring for both hardware and software skills for test and measurement roles.",
                "Expanded the duration of on site interviews and greatly expanded their technical scope.",
                "Added an emphasis on system level thinking in the interview process.",
                "Organized an effort to ensure that new hires would get real work, to improve morale and retention.",
                "Performed resume and phone screening, along with on site interviews."
            ]
        },
        {
            "company": "Raytheon",
            "position": "VIIRS ESTE REA",
            "website": "http://www.raytheon.com/capabilities/products/viirs/",
            "startDate": "2012-08-01",
            "summary": "VIIRS is a spaceborne sensor that provides multispectral radiometric imaging of the earth for weather prediction purposes. It undergoes a long series of intensive tests in simulated environments with spacecraft and ground station simulators. I was the Responsible Engineering Authority (REA) for the ground station and spacecraft simulators (ESTE), in both hardware and software. I undertook a large number of upgrades and improvements, driven by emerging customer needs and evolving program requirements.",
            "highlights": [
                "Made the case for, designed, and implemented a complete redesign and rewrite of the core software of the ESTE (~40,000 lines of new C++)",
                "Made an adapter board to allow the use of cheaper commercial communications boards in place of expensive custom ones",
                "Redesigned the ESTE to support SpaceWire connectivity to support VIIRS upgrades",
                "Designed, built, and maintained an automated data aggregation and transfer system that provided data analysts with test data within 5 minutes of collection, a vast improvement over the several hours of manual work it took previously",
                "Provided 24/7 on call support for several months of continuous testing",
                "Testing completed with a marked (70%) reduction in errors caused the ESTE compared to previous programs, as a result of the above actions."
            ]
        },
        {
            "company": "Raytheon",
            "position": "Test Station Electrical and Software Architect",
            "website": "http://raytheon.com",
            "startDate": "2011-04-01",
            "endDate": "2012-08-01",
            "summary": "A capital project in which I did the entire design and integration flow for the electronics and software back end. Station is a Raytheon capital asset in use today.",
            "highlights": [
                "Gathered electrical and software requirements for the test station",
                "Designed an overall hardware and software architecture to satisfy the requirements",
                "Selected all the components to be used, did the interconnect, wiring, and mechanical design",
                "Designed a web based back end data store and api for both configuration data and telemetry using C#, asp.Net MVC, and XML-RPC (~10,000 lines of code)",
                "Built a client for the api that could be consumed by typical LabVIEW programmers",
                "Worked closely with the LabVIEW front end group, resulting in smooth integration"
            ]
        },
        {
            "company": "NTT Communication Science Laboratories",
            "position": "Summer Intern",
            "website": "http://www.kecl.ntt.co.jp/rps/english/index_e.html",
            "startDate": "2009-06-22",
            "endDate": "2009-08-28",
            "summary": "Worked in the vision group of the NTT Behavioral Research Lab in the NTT Atsugi R&D Center",
            "highlights": [
                "Research on human color perception of materials. Focusing on use of specular and matte reflection by the vision system to infer materials and illuminants in a scene",
                "Experimented with Machine vision techniques for manipulating specular and matter reflection",
                "Designed, built, and tested a device using polarized light to take pictures that could be easily separated for later manipulation in subject testing. Task involved MATLAB, microcontroller (Arduino), stepper motors, motor controllers, circuit design, and fabrication."
            ]
        },
        {
            "company": "Caltech Physics Department",
            "position": "Teaching Assistant, Physics Laboratories",
            "website": "http://www.kecl.ntt.co.jp/rps/english/index_e.html",
            "startDate": "2008-10-01",
            "endDate": "2009-12-01",
            "summary": "Instructed physics students in a hands on laboratory environment.",
            "highlights": [
                "Physics 105, Analog Circuits Laboratory: theory and the practice of designing, analyzing, and constructing analog circuits using passive and active components, including transistors and operational amplifiers.",
                "Physics 6, Sophomore Laboratory in Physics: mass spectroscopy, analysis of resonant circuits, resonant mechanical systems, light spectroscopy, and diffraction of electrons by crystalline solids"
            ]
        }
    ],
    "education": [
        {
            "institution": "Caltech",
            "area": "Physics",
            "studyType": "BS",
            "startDate": "2006-10-01",
            "endDate": "2010-06-01",
            "gpa": "3.5"
        }
    ],
    "awards": [
        {
            "title": "Innovation Award",
            "date": "2012-11-01",
            "awarder": "Raytheon",
            "summary": "Award for a novel configuration database scheme for a test station"
        }
    ],
    "skills": [
        {
            "name": "Languages",
            "level": "Major Work",
            "keywords": [
                "C#",
                "C++"
            ]
        },
        {
            "name": "Frameworks",
            "level": "Major Work",
            "keywords": [
                "C++11/14",
                "boost",
                "Intel TBB",
                "ASP.NET MVC",
                "MSTest",
                "Entity Framework"
            ]
        },
        {
            "name": "Languages",
            "level": "Minor Work",
            "keywords": [
                "Javascript",
                "HTML",
                "Powershell",
                "LaTeX",
                "LabVIEW"
            ]
        },
        {
            "name": "Frameworks",
            "level": "Minor Work",
            "keywords": [
                "node.js",
                "nunjucks.js",
                "Log4CXX"
            ]
        },
        {
            "name": "Techniques",
            "level": "Major Work",
            "keywords": [
                "Agile (Scrum)",
                "Unit Testing",
                "Continuous Integration",
                "White box reverse engineering"
            ]
        },
        {
            "name": "Measurement",
            "level": "Major Work",
            "keywords": [
                "Instrument Selection",
                "Test Design",
                "Testing",
                "Data Analysis"
            ]
        },
        {
            "name": "Electronics",
            "level": "Minor Work",
            "keywords": [
                "Parts Selection",
                "Circuit Design",
                "Schematic Capture",
                "Fabrication"
            ]
        }
    ],
  "languages": [
    {
        "language": "English",
        "fluency": "Native speaker"
    },
    {
        "language": "Japanese",
        "fluency": "JLPT N4"
    }
  ],
  "interests": [
    {
        "name": "Photography",
        "keywords": [
            "Landscape",
            "Product"
        ]
    }
  ]
}